Tekla Open API Reference for Tekla Structures 2025
RebarMesh Properties
The RebarMesh type exposes the following members.
Properties
Name | Description
CatalogName
 The name of the rebar mesh catalog.
Class
 Gets or sets the class of the reinforcement. The class is used to group reinforcements.
 (Inherited from Reinforcement.)
CrossBarLocation
 Defines the location of the crossing bars.
CrossDistances
 The crossing spacing double value(s).
CrossSize
 The size of the crossing rebar.
CutByFatherPartCuts
 Defines whether the rebar mesh is cut by father part cuts or not.
EndFromPlaneOffset
 The end offset value from the part surface.
EndHook
 The hook at the end of the reinforcing.
EndPoint
 The end point of the direction in which the longitudinal bars are distributed.
EndPointOffsetType
 Gets or sets the type of the end point offset. The options are:
OFFSET_TYPE_LEG_LENGTH
OFFSET_TYPE_COVER_THICKNESS
 (Inherited from Reinforcement.)
EndPointOffsetValue
 Gets or sets the concrete cover thickness or leg length at the second end of the bar.
 (Inherited from Reinforcement.)
Father
 Gets or sets the father object of the reinforcement; the model object instance to operate on.
 (Inherited from Reinforcement.)
FromPlaneOffset
 The offset value from the part surface applied in both sides.
 (Overrides Reinforcement.FromPlaneOffset.)
Grade
 Gets or sets the steel grade of the reinforcing bar. The grade indicates the strength of the steel used in reinforcing bars. It can also indicate other factors, such as the weldability or surface deformations of the bar.
 (Inherited from Reinforcement.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
InputPointDeformingState
 Gets or sets the reinforcement input point deforming state.
 (Inherited from Reinforcement.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LeftOverhangCross
 The overhang of the crossing part's left side.
LeftOverhangLongitudinal
 The overhang of the longitudinal bar's left side.
Length
 The length of the rectangle rebar mesh.
LongitudinalDistances
 The longitudinal spacing double value(s).
LongitudinalSize
 The size of the longitudinal rebar.
LongitudinalSpacingMethod
 The type of spacing between rebar mesh bars. Used both for longitudinal and crossing bars. The options are (RebarMesh.RebarMeshSpacingMethodEnum.):
SPACING_TYPE_SAME_DISTANCE
SPACING_TYPE_MULTIPLE_VARYING_DISTANCES
MeshType
 The type of the reinforcement mesh. The options are:
RECTANGULAR_MESH
POLYGON_MESH
BENT_MESH
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the reinforcement.
 (Inherited from Reinforcement.)
NumberingSeries
 Gets or sets the numbering series of the reinforcement.
 (Inherited from Reinforcement.)
OnPlaneOffsets
 Gets or sets the double offset value for each leg on the same plane as the bar.
 (Inherited from Reinforcement.)
Polygon
 The polygon of the mesh.
RadiusValues
 Gets or sets the radius value(s) of the bends in the bar.
 (Inherited from Reinforcement.)
RightOverhangCross
 The right overhang of the crossing bar.
RightOverhangLongitudinal
 The right overhang of the longitudinal bar.
StartFromPlaneOffset
 The start offset value from the part surface.
StartHook
 The hook at the beginning of the reinforcing.
StartPoint
 The start point of the direction in which the longitudinal bars are distributed.
StartPointOffsetType
 Gets or sets the type of the start point offset is either OFFSET_TYPE_LEG_LENGTH or OFFSET_TYPE_COVER_THICKNESS.
 (Inherited from Reinforcement.)
StartPointOffsetValue
 Gets or sets the concrete cover thickness or leg length at the first end of the bar.
 (Inherited from Reinforcement.)
Width
 The width of the rectangle rebar mesh.
Top
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace